brew "ansible"
brew "ansible-lint"
brew "asciinema"
brew "awscli"
brew "bat"
brew "curl"
brew "derailed/k9s/k9s"
brew "fzf"
brew "gh"
brew "git"
brew "glances"
brew "httpie"
brew "jq"
brew "kubectx"
brew "kubernetes-cli"
brew "lsd"
brew "mkcert"
brew "neovim"
brew "node"
brew "openssh"
brew "openssl@1.1"
brew "postgresql"
brew "python@3.8"
brew "ripgrep"
brew "tldr"
brew "wget"

tap "homebrew/bundle"
tap "homebrew/core"

if OS.mac?
    brew "mas"
    tap "homebrew/cask"
    tap "homebrew/cask-drivers"
    tap "homebrew/cask-fonts"
    tap "homebrew/cask-versions"
    cask "1password"
    cask "alfred"
    cask "brave-browser"
    cask "commander-one"
    cask "dash"
    cask "docker"
    cask "font-hack-nerd-font"
    cask "font-jetbrains-mono"
    cask "gitkraken"
    cask "iterm2"
    cask "jetbrains-toolbox"
    cask "slack"
    cask "spotify"
    cask "vagrant"
    cask "visual-studio-code"
end
